---
type: WireSize
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# WireSize

`Autodesk.Revit.DB.Electrical.WireSize` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Ampacity | — | `public long Ampacity { get ; }` |
| Property | Diameter | — | `public double Diameter { get ; }` |
| Property | InUse | — | `public bool InUse { get ; set ; }` |
| Property | Size | — | `public string Size { get ; }` |